Revit 2027 API
ImageFileType Enumeration
 This enum is used to define exported file type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ImageFileType
Public Enumeration ImageFileType
public enum class ImageFileType
type ImageFileType
Members
Member name | Value | Description
BMP | 0 |  BMP
JPEGLossless | 1 |  JPEG with high quality picture
JPEGMedium | 2 |  JPEG with medium quality picture
JPEGSmallest | 3 |  JPEG with lower quality picture and small file size
PNG | 4 |  PNG
TARGA | 5 |  TARGA
TIFF | 6 |  TIFF
See Also
Reference
Autodesk.Revit.DB Namespace